{
  "domain": "Recruitment & Talent Acquisition",
  "glossary": [
    {
      "term": "candidate",
      "definition": "An individual who has applied for a job posting or has been sourced for a position"
    },
    {
      "term": "application",
      "definition": "A candidate's submission for a specific job posting, including resume, cover letter, and application data"
    },
    {
      "term": "job_posting",
      "definition": "A published job opening with title, description, requirements, and metadata (status, location, department, etc.)"
    },
    {
      "term": "application_status",
      "definition": "Current state in the recruitment pipeline: applied, screening, phone_screen, interview_scheduled, interview_completed, offer_pending, offer_sent, offer_accepted, offer_declined, rejected, withdrawn"
    },
    {
      "term": "interview",
      "definition": "A scheduled meeting between candidate and interviewer(s) with type (phone, video, onsite), date/time, location, and participants"
    },
    {
      "term": "offer",
      "definition": "A formal job offer extended to a candidate with compensation details, start date, and terms"
    },
    {
      "term": "recruitment_workflow",
      "definition": "The sequence of stages a candidate moves through from application to hire, configurable per job posting or department"
    },
    {
      "term": "candidate_profile",
      "definition": "Persistent record of candidate information, skills, experience, and application history across multiple job postings"
    },
    {
      "term": "sourcing",
      "definition": "The process of identifying and attracting candidates, including external job boards, referrals, and internal transfers"
    },
    {
      "term": "pipeline",
      "definition": "The collection of candidates at various stages for a specific job posting or department"
    },
    {
      "term": "ATS",
      "definition": "Applicant Tracking System - the system managing recruitment workflows and candidate data"
    }
  ],
  "business_rules": [
    "A candidate can have multiple applications for different job postings, but only one active application per job posting",
    "Application status transitions must follow the defined workflow stages (cannot skip stages unless workflow allows)",
    "Job postings must have at least one hiring manager or recruiter assigned before accepting applications",
    "Interviews can only be scheduled for candidates in 'screening', 'phone_screen', or 'interview_scheduled' status",
    "Offers can only be extended to candidates who have completed all required interview stages",
    "Once an offer is accepted, the candidate's status becomes 'offer_accepted' and other applications for the same candidate should be marked as 'withdrawn' or 'rejected'",
    "Job postings have effective dates (published_date, closed_date) and cannot accept applications outside this window",
    "Candidate profiles are tenant-scoped; candidates cannot be shared across tenants without explicit permission",
    "All candidate data modifications must be audited with user_id, timestamp, and change details",
    "Recruiters can view all applications within their assigned job postings or departments",
    "Hiring managers can only view applications for job postings they are assigned to",
    "Candidates can only view their own application status and details",
    "Application status changes trigger notifications to relevant parties (candidate, recruiter, hiring manager) based on notification preferences",
    "Job postings can be cloned to create similar postings with pre-filled data",
    "Application attachments (resumes, cover letters) must be stored securely and accessible only to authorized users",
    "Interview scheduling must respect interviewer availability and timezone settings",
    "Offer amounts and details are visible only to authorized recruiters and hiring managers, not to candidates until offer is sent"
  ],
  "calculations_or_formulas": [
    "Time-to-fill = (offer_accepted_date - job_posting.published_date) in days",
    "Application conversion rate = (applications with status >= interview_scheduled) / total_applications * 100",
    "Offer acceptance rate = (offers_accepted) / (offers_sent) * 100",
    "Interview scheduling: candidate_timezone and interviewer_timezone must be considered when displaying/calculating interview times",
    "Application score (if used) = weighted sum of qualifications, experience match, skills assessment, interview ratings"
  ],
  "invariants": [
    "A candidate profile must have at least: email (unique per tenant), first_name, last_name",
    "An application must belong to exactly one job_posting and one candidate",
    "An interview must be associated with at least one application and one interviewer",
    "An offer must be associated with exactly one application",
    "Job posting status must be one of: draft, published, closed, cancelled",
    "Application status cannot transition backwards (e.g., from 'offer_sent' to 'interview_scheduled') unless explicitly allowed by workflow rules",
    "Tenant isolation: all recruitment data must be scoped by tenant_id; cross-tenant queries are forbidden",
    "Soft deletes: candidates, applications, and job postings are soft-deleted (deleted_at) not hard-deleted to maintain audit trail",
    "A job posting cannot be deleted if it has active applications (status not in [rejected, withdrawn, offer_declined])"
  ],
  "edge_cases": [
    "Candidate applies to same job posting twice - system should prevent duplicate or merge into single application",
    "Job posting is closed while candidate has pending interview - should allow interview to proceed but prevent new applications",
    "Interviewer cancels interview last minute - system should notify candidate and allow rescheduling",
    "Multiple offers extended to same candidate for different positions - candidate can only accept one",
    "Candidate withdraws application after offer is sent - offer status should be updated to 'withdrawn'",
    "Job posting requirements change after applications received - existing applications should not be auto-rejected, but new applications use new requirements",
    "Interview scheduled in past (data migration scenario) - system should handle gracefully without validation errors",
    "Candidate email changes - system should update all related records and maintain audit trail",
    "Bulk import of candidates/applications - must handle duplicates, validation errors, and partial failures",
    "Recruiter leaves company - job postings and applications should be reassigned, not orphaned",
    "Job posting is cancelled with active interviews scheduled - should notify all participants and update application statuses",
    "Offer expires before candidate responds - system should auto-update status and notify recruiter",
    "Candidate applies via external job board integration - application should be created with source tracking",
    "Interview feedback submitted after application is rejected - should still be stored for historical purposes",
    "Timezone handling: candidate in EST, interviewer in PST, job posting in UTC - all times must be correctly converted and displayed"
  ],
  "compliance_requirements": [
    "GDPR/Data Privacy: Candidates must be able to request their data, export it, and request deletion (right to be forgotten)",
    "Data retention: Candidate data must be retained for minimum period (e.g., 2-7 years depending on jurisdiction) even after application closure",
    "PII encryption: All candidate PII (email, phone, address, SSN/ID numbers) must be encrypted at rest and in transit",
    "Access logging: All access to candidate PII must be logged with user_id, timestamp, and purpose",
    "Consent management: Candidates must explicitly consent to data processing and storage",
    "Data minimization: Only collect candidate data necessary for recruitment process",
    "Audit trail: All changes to candidate data, application status, and offers must be auditable",
    "Multi-tenant isolation: Strict data isolation between tenants; no cross-tenant data access",
    "Background check compliance: If background checks are performed, comply with FCRA (US) or local equivalent",
    "Equal opportunity: System should support EEO data collection and reporting without biasing hiring decisions",
    "Interview recording: If interviews are recorded, explicit consent must be obtained and stored"
  ],
  "data_requirements": {
    "inputs": [
      "Candidate: email (unique per tenant), first_name, last_name, phone (optional), resume, cover_letter, application_answers",
      "Job posting: title, description, requirements, department, location, employment_type, salary_range, published_date, closed_date, status",
      "Interview: application_id, interviewer_id(s), interview_type, scheduled_at, location (physical or video link), timezone",
      "Offer: application_id, salary, start_date, benefits, expiration_date, offer_letter_document",
      "Application status change: application_id, new_status, changed_by_user_id, reason (optional)",
      "Interview feedback: interview_id, interviewer_id, rating, notes, recommendation (hire/no_hire/maybe)"
    ],
    "outputs": [
      "Candidate profile with application history across all job postings",
      "Application details with current status, timeline, and all associated interviews/offers",
      "Job posting with current application count, pipeline status, and key metrics",
      "Interview schedule with timezone-adjusted times for all participants",
      "Offer details with terms and acceptance status",
      "Recruitment metrics: time-to-fill, conversion rates, pipeline health, source effectiveness",
      "Audit log of all data changes and access events",
      "Notification events for status changes, interview reminders, offer expirations"
    ]
  },
  "user_journeys": [
    "Candidate applies: Browse job postings → View job details → Submit application (upload resume, answer questions) → Receive confirmation → Track application status → Receive interview invite → Schedule interview → Attend interview → Receive offer (if selected) → Accept/decline offer",
    "Recruiter manages pipeline: View job posting → Review applications → Screen candidates → Schedule interviews → Collect interview feedback → Make hiring decision → Extend offer → Onboard new hire",
    "Hiring manager reviews: View assigned job postings → Review candidate applications → Provide interview feedback → Approve/reject candidates → Review offer details → Approve offer extension",
    "HR Admin configures: Create job posting → Define workflow stages → Set up interview templates → Configure notification rules → Manage user permissions → Generate reports"
  ],
  "acceptance_criteria_suggestions": [
    "Candidate can apply to a job posting and receive immediate confirmation with application ID",
    "Application status updates trigger email notifications to candidate within 5 minutes",
    "Interview scheduling allows selecting multiple interviewers and automatically checks availability",
    "Interview times are displayed in candidate's local timezone with clear timezone indicators",
    "Offer letter can be generated as PDF and sent to candidate via secure link",
    "Candidate can accept/decline offer through self-service portal or email link",
    "Recruiter can view all applications in pipeline view with filterable status, date, and source",
    "Bulk actions (reject multiple applications, send bulk emails) are available with confirmation dialogs",
    "Job posting analytics show application count, conversion rates, and time-to-fill metrics",
    "Candidate profile shows complete application history across all job postings within tenant",
    "Data export for candidate includes all application data, interview notes, and offer details in structured format",
    "Soft-deleted candidates/applications are excluded from normal queries but accessible via admin interface for audit purposes"
  ],
  "open_questions": [
    "What is the exact workflow stage sequence? Is it configurable per job posting or department?",
    "Are there different workflows for different types of roles (executive vs. entry-level)?",
    "How are interview feedback ratings structured? (1-5 scale, hire/no-hire, specific criteria?)",
    "What happens to candidate data when they become an employee? Should it merge with employee record?",
    "Are there integration requirements with external job boards (LinkedIn, Indeed, etc.)?",
    "Is there a referral system? How are employee referrals tracked and rewarded?",
    "Are background checks integrated? What is the workflow for initiating and reviewing background checks?",
    "How are offer negotiations handled? Can offers be revised before acceptance?",
    "What reporting/analytics requirements exist beyond basic pipeline metrics?",
    "Are there automated screening rules (e.g., auto-reject based on keywords, auto-advance based on qualifications)?",
    "How are interview no-shows handled? Automatic rescheduling or manual intervention?",
    "What is the data retention policy? How long should candidate data be kept after application closure?",
    "Are there compliance requirements specific to the jurisdiction (Mexico, US, etc.)?",
    "How are bulk imports handled? CSV format? API? What validation is required?",
    "Is there a candidate portal for self-service, or is all communication via email?",
    "How are interview recordings stored and accessed? What are the retention policies?",
    "Are there ATS integrations (Greenhouse, Lever, etc.) that need to be considered?",
    "What is the expected volume? (applications per day, concurrent users, data size)"
  ],
  "assumptions": [
    "Recruitment workflows follow a standard pipeline: Applied → Screening → Interview → Offer → Hired",
    "Multi-tenant isolation is enforced at the database/application layer (tenant_id on all tables)",
    "Authentication is handled by a shared auth service or peoplecloud, not within recruitment service",
    "File storage (resumes, offer letters) uses a shared storage service (S3, etc.) with tenant-scoped paths",
    "Notifications are sent via email primarily, with optional SMS/push notifications",
    "Interview scheduling respects business hours (e.g., 9 AM - 5 PM) unless explicitly configured otherwise",
    "Job postings can be in multiple languages, but primary language is defined per posting",
    "Candidate profiles persist even after application closure to enable future applications and analytics",
    "The system supports both internal and external job postings (public vs. internal-only)",
    "Recruiters and hiring managers have different permission levels (recruiters can manage all, hiring managers only assigned postings)"
  ],
  "sources": [
    "Current peoplecloud monolith recruitment module implementation",
    "Standard ATS (Applicant Tracking System) best practices",
    "GDPR and data privacy regulations",
    "Industry recruitment workflow patterns"
  ],
  "confidence": "medium"
}

